# CannotCopyNoAttachedParent Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyNoAttachedParent Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Attached Detail Group can't be copied without its Model Group
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyNoAttachedParent { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyNoAttachedParent As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyNoAttachedParent {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace